{
  "basics": {
    "name": "Luke Karrys",
    "label": "Programmer",
    "picture": "https://andyet.com/images/team/lukelarge2x.jpg",
    "email": "luke@lukekarrys.com",
    "phone": "(480) 389-4575",
    "website": "http://lukekarrys.com",
    "summary": "Luke is a Node.js and front-end developer who is at home anywhere in a project from the API to the UX. He received his Bachelor of Science degree in software Engineering from the University of Advancing Technology in Tempe, AZ. Lately he's found a stack of Hapi, Postgres, React, Babel, Webpack and CSS Modules to be a pretty nice fit for creating exceptional user experiences. Above all, he belives that software is about people.",
    "location": {
      "address": "759 West Haught Avenue",
      "postalCode": "85541",
      "city": "Payson",
      "countryCode": "US",
      "region": "Arizona"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "lukekarrys",
        "url": "https://github.com/lukekarrys"
      },
      {
        "network": "archive",
        "username": "lukekarrys",
        "url": "http://npmjs.org/~lukekarrys"
      },
      {
        "network": "rss-square",
        "username": "lukecod.es",
        "url": "http://lukecod.es"
      }
    ]
  },
  "work": [
    {
      "company": "&yet",
      "position": "JavaScript Developer",
      "website": "https://andyet.com",
      "startDate": "2013-01-01",
      "summary": "Developed web applications for clients and internally using Node.js and a variety of front-end technologies like React, Webpack, and ES2015.",
      "highlights": [
        "Led front-end development of multi-platform single page app for CAA's music clients to plan and route worldwide tours",
        "Developed the front-end and parts of the API for the Node Security Platform's public and admin interfaces",
        "Wireframed and developed front-end and application server for Heroku data vizualization to showcase Kafka addon",
        "Created and maintained and extracted open source software from projects"
      ]
    },
    {
      "company": "meltmedia",
      "position": "Front-End Developer",
      "website": "https://meltmedia.com",
      "startDate": "2011-02-01",
      "endDate": "2013-01-01",
      "summary": "Led development of front-end solutions to be used across different teams creating markting sites for Genentech and other clients",
      "highlights": [
        "Consolidated marketing sites to use a single front-end framework and shared plugins with require.js",
        "Wrote plugins for multi-platform analytics, glossary word highlighting, and push state navigation for use across all sites",
        "Researched and prototyped a multi-choice quiz application using only JavaScript to replace a legacy Flash solution"
      ]
    },
    {
      "company": "Jawa",
      "position": "Web and Game Developer",
      "startDate": "2010-02-01",
      "endDate": "2011-02-01",
      "summary": "Managed front-end development emphasizing code reuse and repeatable deployment patterns of 100+ marketing sites",
      "highlights": [
        "Managed a team creating front-end templates for a large stable of MVC data driven sites with an emphasis in cross-browser compatibility and HTML &amp; CSS reuse",
        "Worked as a team member writing full stack code (PHP, HTML, CSS, JS) for MVC architected websites",
        "Write custom tooling to ease developer experience in writing, managing, and deploying many concurrent projects",
        "Develop game logic AS3 classes, PHP and JS to create a isometric Flash games for deployment to Facebook"
      ]
    },
    {
      "company": "Mosaic Team",
      "position": "Web Developer",
      "startDate": "2008-12-01",
      "endDate": "2010-02-01",
      "summary": "Developed front and back-end solutions for small business clients using PHP and JavaScript",
      "highlights": [
        "Create custom season ticketing interface for local theatres to use",
        "Create template editor for clients to customize sites for their small business",
        "Communicate with coworkers, supervisors and clients about project goals and results"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Advancing Technology",
      "area": "Software Engineering",
      "studyType": "Bachelor",
      "startDate": "2005-09-01",
      "endDate": "2008-12-01",
      "gpa": "3.73",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Finalist",
      "date": "2015-02-01",
      "awarder": "Static Showdown",
      "summary": "<a href='http://gifchess.club'>gifchess.club</a> – <a href='https://2015.staticshowdown.com/winners'>Static Showdown</a> – Chess combined with animated webcam GIFs. Built with Ampersand, LESS, and Firebase."
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "Advanced",
      "keywords": [
        "HTML",
        "CSS",
        "ES2015+"
      ]
    },
    {
      "name": "Front-End Tooling",
      "level": "Advanced",
      "keywords": [
        "webpack",
        "gulp",
        "grunt"
      ]
    },
    {
      "name": "CSS Processing",
      "level": "Advanced",
      "keywords": [
        "postcss",
        "less",
        "sass"
      ]
    },
    {
      "name": "JS Frameworks",
      "level": "Advanced",
      "keywords": [
        "react",
        "backbone",
        "ampersand",
        "redux"
      ]
    },
    {
      "name": "Data Vizualization",
      "level": "Advanced",
      "keywords": [
        "d3",
        "animation",
        "responsive"
      ]
    }
  ],
  "interests": [],
  "references": []
}
